dev-board-tech/ArduinoHK32F030M/hardware/hk32f030m/0.1.0/boards.txt
D4P6.menu.opt.osstd=Smallest (-Os default)
D4P6.menu.opt.oslto=Smallest (-Os) with LTO
D4P6.menu.opt.oslto.build.flags.optimize=-Os -flto
D4P6.menu.opt.o1std=Fast (-O1)
D4P6.menu.opt.o1std.build.flags.optimize=-O1
D4P6.menu.opt.o1lto=Fast (-O1) with LTO
D4P6.menu.opt.o1lto.build.flags.optimize=-O1 -flto
D4P6.menu.opt.o2std=Faster (-O2)
D4P6.menu.opt.o2std.build.flags.optimize=-O2
D4P6.menu.opt.o2lto=Faster (-O2) with LTO
D4P6.menu.opt.o2lto.build.flags.optimize=-O2 -flto
D4P6.menu.opt.o3std=Fastest (-O3)
D4P6.menu.opt.o3std.build.flags.optimize=-O3
D4P6.menu.opt.o3lto=Fastest (-O3) with LTO
D4P6.menu.opt.o3lto.build.flags.optimize=-O3 -flto
D4P6.menu.opt.ogstd=Debug (-Og)
D4P6.menu.opt.ogstd.build.flags.optimize=-Og
D4P6.menu.opt.o0std=No Optimization (-O0)
D4P6.menu.opt.o0std.build.flags.optimize=-O0

D4P6.menu.dbg.none=None
D4P6.menu.dbg.enable_sym=Symbols Enabled (-g)
D4P6.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
D4P6.menu.dbg.enable_log=Core logs Enabled
D4P6.menu.dbg.enable_log.build.flags.debug=
D4P6.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
D4P6.menu.dbg.enable_all.build.flags.debug=-g

D4P6.menu.rtlib.nano=Newlib Nano (default)
D4P6.menu.rtlib.nanofp=Newlib Nano + Float Printf
D4P6.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
D4P6.menu.rtlib.nanofs=Newlib Nano + Float Scanf
D4P6.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
D4P6.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
D4P6.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
D4P6.menu.rtlib.full=Newlib Standard
D4P6.menu.rtlib.full.build.flags.ldspecs=

###############################
# HK32F030MF4P6
F4P6.name=HK32F030MF4P6

F4P6.build.core=arduino
F4P6.build.board=F4P6
F4P6.build.mcu=cortex-m0
F4P6.build.series=HK32F030M
F4P6.build.st_extra_flags=-D{build.product_line} {build.xSerial} {build.xI2C} {build.xSPI} {build.RTOS} -DEXTCLK_VALUE={build.extclk}
F4P6.build.flash_offset=0x0
F4P6.upload.maximum_size=0
F4P6.upload.maximum_data_size=0
F4P6.openocd.target=stm32f0x
F4P6.vid.0=0x0483
F4P6.pid.0=0x5740

# DEMO_F030M_8M board
F4P6.menu.pnum.HK32F030MF4P6=HK32F030MF4P6 (HSI 8Mhz)
F4P6.menu.pnum.HK32F030MF4P6.upload.maximum_size=16384
F4P6.menu.pnum.HK32F030MF4P6.upload.maximum_data_size=2048
F4P6.menu.pnum.HK32F030MF4P6.build.board=HK32F030MF4P6
F4P6.menu.pnum.HK32F030MF4P6.build.clksrc=SYSCLK_SRC_HSI8M
F4P6.menu.pnum.HK32F030MF4P6.build.product_line=hk32f030mf4p6
F4P6.menu.pnum.HK32F030MF4P6.build.variant=HK32F030M/F4P6
F4P6.menu.pnum.HK32F030MF4P6.build.variant_h=variant_HK32F030MF4P6.h
F4P6.menu.pnum.HK32F030MF4P6.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_16M board
F4P6.menu.pnum.HK32F030MF4P6_16M=HK32F030MF4P6 (HSI 16Mhz)
F4P6.menu.pnum.HK32F030MF4P6_16M.upload.maximum_size=16384
F4P6.menu.pnum.HK32F030MF4P6_16M.upload.maximum_data_size=2048
F4P6.menu.pnum.HK32F030MF4P6_16M.build.board=HK32F030MF4P6
F4P6.menu.pnum.HK32F030MF4P6_16M.build.clksrc=SYSCLK_SRC_HSI16M
F4P6.menu.pnum.HK32F030MF4P6_16M.build.product_line=hk32f030mf4p6
F4P6.menu.pnum.HK32F030MF4P6_16M.build.variant=HK32F030M/F4P6
F4P6.menu.pnum.HK32F030MF4P6_16M.build.variant_h=variant_HK32F030MF4P6.h
F4P6.menu.pnum.HK32F030MF4P6_16M.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_32M board
F4P6.menu.pnum.HK32F030MF4P6_32M=HK32F030MF4P6 (HSI 32Mhz)
F4P6.menu.pnum.HK32F030MF4P6_32M.upload.maximum_size=16384
F4P6.menu.pnum.HK32F030MF4P6_32M.upload.maximum_data_size=2048
F4P6.menu.pnum.HK32F030MF4P6_32M.build.board=HK32F030MF4P6
F4P6.menu.pnum.HK32F030MF4P6_32M.build.clksrc=SYSCLK_SRC_HSI32M
F4P6.menu.pnum.HK32F030MF4P6_32M.build.product_line=hk32f030mf4p6
F4P6.menu.pnum.HK32F030MF4P6_32M.build.variant=HK32F030M/F4P6
F4P6.menu.pnum.HK32F030MF4P6_32M.build.variant_h=variant_HK32F030MF4P6.h
F4P6.menu.pnum.HK32F030MF4P6_32M.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_LSI board
F4P6.menu.pnum.HK32F030MF4P6_LSI=HK32F030MF4P6 (LSI internal RC oscillator)
F4P6.menu.pnum.HK32F030MF4P6_LSI.upload.maximum_size=16384
F4P6.menu.pnum.HK32F030MF4P6_LSI.upload.maximum_data_size=2048
F4P6.menu.pnum.HK32F030MF4P6_LSI.build.board=HK32F030MF4P6
F4P6.menu.pnum.HK32F030MF4P6_LSI.build.clksrc=SYSCLK_SRC_LSI
F4P6.menu.pnum.HK32F030MF4P6_LSI.build.product_line=hk32f030mf4p6
F4P6.menu.pnum.HK32F030MF4P6_LSI.build.variant=HK32F030M/F4P6
F4P6.menu.pnum.HK32F030MF4P6_LSI.build.variant_h=variant_HK32F030MF4P6.h
F4P6.menu.pnum.HK32F030MF4P6_LSI.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_EXTKLK board
F4P6.menu.pnum.HK32F030MF4P6_EXT=HK32F030MF4P6 (External clock)
F4P6.menu.pnum.HK32F030MF4P6_EXT.upload.maximum_size=16384
F4P6.menu.pnum.HK32F030MF4P6_EXT.upload.maximum_data_size=2048
F4P6.menu.pnum.HK32F030MF4P6_EXT.build.board=HK32F030MF4P6
F4P6.menu.pnum.HK32F030MF4P6_EXT.build.clksrc=SYSCLK_SCR_EXTCLK_IO
F4P6.menu.pnum.HK32F030MF4P6_EXT.build.product_line=hk32f030mf4p6
F4P6.menu.pnum.HK32F030MF4P6_EXT.build.variant=HK32F030M/F4P6
F4P6.menu.pnum.HK32F030MF4P6_EXT.build.variant_h=variant_HK32F030MF4P6.h
F4P6.menu.pnum.HK32F030MF4P6_EXT.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

F4P6.menu.extclk.32mhz=32000Khz
F4P6.menu.extclk.24mhz=24000Khz
F4P6.menu.extclk.24mhz.build.extclk=24000000
F4P6.menu.extclk.20mhz=20000Khz
F4P6.menu.extclk.20mhz.build.extclk=20000000
F4P6.menu.extclk.16mhz=16000Khz
F4P6.menu.extclk.16mhz.build.extclk=16000000
F4P6.menu.extclk.12mhz=120000Khz
F4P6.menu.extclk.12mhz.build.extclk=12000000
F4P6.menu.extclk.10mhz=10000Khz
F4P6.menu.extclk.10mhz.build.extclk=10000000
F4P6.menu.extclk.8mhz=8000Khz
F4P6.menu.extclk.8mhz.build.extclk=8000000
F4P6.menu.extclk.73728khz=73728Khz
F4P6.menu.extclk.73728khz.build.extclk=73728000
F4P6.menu.extclk.6mhz=6000Khz
F4P6.menu.extclk.6mhz.build.extclk=6000000
F4P6.menu.extclk.4mhz=4000Khz
F4P6.menu.extclk.4mhz.build.extclk=4000000
F4P6.menu.extclk.36864khz=36864Khz
F4P6.menu.extclk.36864khz.build.extclk=36864000
F4P6.menu.extclk.2mhz=2000Khz
F4P6.menu.extclk.2mhz.build.extclk=2000000
F4P6.menu.extclk.1mhz=4000Khz
F4P6.menu.extclk.1mhz.build.extclk=1000000

# Upload menu
F4P6.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
F4P6.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
F4P6.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

F4P6.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
F4P6.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
F4P6.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload
F4P6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
F4P6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.1={runtime.platform.path}/debugger/select_swd.cfg

F4P6.menu.xserial.generic=Enabled (generic 'Serial')
F4P6.menu.xserial.none=Enabled (no generic 'Serial')
F4P6.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
F4P6.menu.xserial.disabled=Disabled (no Serial support)
F4P6.menu.xserial.disabled.build.xSerial=

F4P6.menu.xi2c.generic=Enabled (generic 'I2C')
F4P6.menu.xi2c.none=Enabled (no generic 'I2C')
F4P6.menu.xi2c.none.build.xi2c=-DHAL_I2C_MODULE_ENABLED -DI2C_NONE
F4P6.menu.xi2c.disabled=Disabled (no I2C support)
F4P6.menu.xi2c.disabled.build.xI2C=

