dev-board-tech/ArduinoHK32F030M/hardware/hk32f030m/0.1.0/boards.txt
F4U6.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
F4U6.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
F4U6.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload
F4U6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
F4U6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.1={runtime.platform.path}/debugger/select_swd.cfg

F4U6.menu.xserial.generic=Enabled (generic 'Serial')
F4U6.menu.xserial.none=Enabled (no generic 'Serial')
F4U6.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
F4U6.menu.xserial.disabled=Disabled (no Serial support)
F4U6.menu.xserial.disabled.build.xSerial=

F4U6.menu.xi2c.generic=Enabled (generic 'I2C')
F4U6.menu.xi2c.none=Enabled (no generic 'I2C')
F4U6.menu.xi2c.none.build.xi2c=-DHAL_I2C_MODULE_ENABLED -DI2C_NONE
F4U6.menu.xi2c.disabled=Disabled (no I2C support)
F4U6.menu.xi2c.disabled.build.xI2C=

F4U6.menu.xspi.generic=Enabled (generic 'SPI')
F4U6.menu.xspi.none=Enabled (no generic 'SPI')
F4U6.menu.xspi.none.build.xspi=-DHAL_SPI_MODULE_ENABLED -DSPI_NONE
F4U6.menu.xspi.disabled=Disabled (no SPI support)
F4U6.menu.xspi.disabled.build.xSPI=

F4U6.menu.rtos.enabled=Enabled
F4U6.menu.rtos.disabled=Disabled
F4U6.menu.rtos.disabled.build.RTOS=

F4U6.menu.opt.osstd=Smallest (-Os default)
F4U6.menu.opt.oslto=Smallest (-Os) with LTO
F4U6.menu.opt.oslto.build.flags.optimize=-Os -flto
F4U6.menu.opt.o1std=Fast (-O1)
F4U6.menu.opt.o1std.build.flags.optimize=-O1
F4U6.menu.opt.o1lto=Fast (-O1) with LTO
F4U6.menu.opt.o1lto.build.flags.optimize=-O1 -flto
F4U6.menu.opt.o2std=Faster (-O2)
F4U6.menu.opt.o2std.build.flags.optimize=-O2
F4U6.menu.opt.o2lto=Faster (-O2) with LTO
F4U6.menu.opt.o2lto.build.flags.optimize=-O2 -flto
F4U6.menu.opt.o3std=Fastest (-O3)
F4U6.menu.opt.o3std.build.flags.optimize=-O3
F4U6.menu.opt.o3lto=Fastest (-O3) with LTO
F4U6.menu.opt.o3lto.build.flags.optimize=-O3 -flto
F4U6.menu.opt.ogstd=Debug (-Og)
F4U6.menu.opt.ogstd.build.flags.optimize=-Og
F4U6.menu.opt.o0std=No Optimization (-O0)
F4U6.menu.opt.o0std.build.flags.optimize=-O0

F4U6.menu.dbg.none=None
F4U6.menu.dbg.enable_sym=Symbols Enabled (-g)
F4U6.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
F4U6.menu.dbg.enable_log=Core logs Enabled
F4U6.menu.dbg.enable_log.build.flags.debug=
F4U6.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
F4U6.menu.dbg.enable_all.build.flags.debug=-g

F4U6.menu.rtlib.nano=Newlib Nano (default)
F4U6.menu.rtlib.nanofp=Newlib Nano + Float Printf
F4U6.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
F4U6.menu.rtlib.nanofs=Newlib Nano + Float Scanf
F4U6.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
F4U6.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
F4U6.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
F4U6.menu.rtlib.full=Newlib Standard
F4U6.menu.rtlib.full.build.flags.ldspecs=

###############################
# HK32F030MF4N6
F4N6.name=HK32F030MF4N6

F4N6.build.core=arduino
F4N6.build.board=F4N6
F4N6.build.mcu=cortex-m0
F4N6.build.series=HK32F030M
F4N6.build.st_extra_flags=-D{build.product_line} {build.xSerial} {build.xI2C} {build.xSPI} {build.RTOS} -DEXTCLK_VALUE={build.extclk}
F4N6.build.flash_offset=0x0
F4N6.upload.maximum_size=0
F4N6.upload.maximum_data_size=0
F4N6.openocd.target=stm32f0x
F4N6.vid.0=0x0483
F4N6.pid.0=0x5740

# DEMO_F030M_8M board
F4N6.menu.pnum.HK32F030MF4N6=HK32F030MF4N6 (HSI 8Mhz)
F4N6.menu.pnum.HK32F030MF4N6.upload.maximum_size=16384
F4N6.menu.pnum.HK32F030MF4N6.upload.maximum_data_size=2048
F4N6.menu.pnum.HK32F030MF4N6.build.board=HK32F030MF4N6
F4N6.menu.pnum.HK32F030MF4N6.build.clksrc=SYSCLK_SRC_HSI8M
F4N6.menu.pnum.HK32F030MF4N6.build.product_line=hk32f030mf4p6
F4N6.menu.pnum.HK32F030MF4N6.build.variant=HK32F030M/F4N6
F4N6.menu.pnum.HK32F030MF4N6.build.variant_h=variant_HK32F030MF4N6.h
F4N6.menu.pnum.HK32F030MF4N6.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_16M board
F4N6.menu.pnum.HK32F030MF4N6_16M=HK32F030MF4N6 (HSI 16Mhz)
F4N6.menu.pnum.HK32F030MF4N6_16M.upload.maximum_size=16384
F4N6.menu.pnum.HK32F030MF4N6_16M.upload.maximum_data_size=2048
F4N6.menu.pnum.HK32F030MF4N6_16M.build.board=HK32F030MF4N6
F4N6.menu.pnum.HK32F030MF4N6_16M.build.clksrc=SYSCLK_SRC_HSI16M
F4N6.menu.pnum.HK32F030MF4N6_16M.build.product_line=hk32f030mf4p6
F4N6.menu.pnum.HK32F030MF4N6_16M.build.variant=HK32F030M/F4N6
F4N6.menu.pnum.HK32F030MF4N6_16M.build.variant_h=variant_HK32F030MF4N6.h
F4N6.menu.pnum.HK32F030MF4N6_16M.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_32M board
F4N6.menu.pnum.HK32F030MF4N6_32M=HK32F030MF4N6 (HSI 32Mhz)
F4N6.menu.pnum.HK32F030MF4N6_32M.upload.maximum_size=16384
F4N6.menu.pnum.HK32F030MF4N6_32M.upload.maximum_data_size=2048
F4N6.menu.pnum.HK32F030MF4N6_32M.build.board=HK32F030MF4N6
F4N6.menu.pnum.HK32F030MF4N6_32M.build.clksrc=SYSCLK_SRC_HSI32M
F4N6.menu.pnum.HK32F030MF4N6_32M.build.product_line=hk32f030mf4p6
F4N6.menu.pnum.HK32F030MF4N6_32M.build.variant=HK32F030M/F4N6
F4N6.menu.pnum.HK32F030MF4N6_32M.build.variant_h=variant_HK32F030MF4N6.h
F4N6.menu.pnum.HK32F030MF4N6_32M.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_LSI board
F4N6.menu.pnum.HK32F030MF4N6_LSI=HK32F030MF4N6 (LSI internal RC oscillator)
F4N6.menu.pnum.HK32F030MF4N6_LSI.upload.maximum_size=16384
F4N6.menu.pnum.HK32F030MF4N6_LSI.upload.maximum_data_size=2048
F4N6.menu.pnum.HK32F030MF4N6_LSI.build.board=HK32F030MF4N6
F4N6.menu.pnum.HK32F030MF4N6_LSI.build.clksrc=SYSCLK_SRC_LSI
F4N6.menu.pnum.HK32F030MF4N6_LSI.build.product_line=hk32f030mf4p6
F4N6.menu.pnum.HK32F030MF4N6_LSI.build.variant=HK32F030M/F4N6
F4N6.menu.pnum.HK32F030MF4N6_LSI.build.variant_h=variant_HK32F030MF4N6.h
F4N6.menu.pnum.HK32F030MF4N6_LSI.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_EXTKLK board
F4N6.menu.pnum.HK32F030MF4N6_EXT=HK32F030MF4N6 (External clock)
F4N6.menu.pnum.HK32F030MF4N6_EXT.upload.maximum_size=16384
F4N6.menu.pnum.HK32F030MF4N6_EXT.upload.maximum_data_size=2048
F4N6.menu.pnum.HK32F030MF4N6_EXT.build.board=HK32F030MF4N6
F4N6.menu.pnum.HK32F030MF4N6_EXT.build.clksrc=SYSCLK_SCR_EXTCLK_IO
F4N6.menu.pnum.HK32F030MF4N6_EXT.build.product_line=hk32f030mf4p6
F4N6.menu.pnum.HK32F030MF4N6_EXT.build.variant=HK32F030M/F4N6
F4N6.menu.pnum.HK32F030MF4N6_EXT.build.variant_h=variant_HK32F030MF4N6.h
F4N6.menu.pnum.HK32F030MF4N6_EXT.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

